Revit 2026 API

# ConnectionInputPoint(XYZ) Constructor

---

Construct an input point from 3d point. A new valid id will be auto-generated.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ConnectionInputPoint(
	XYZ pt
)
```
```vb
Public Sub New (
	pt As XYZ
)
```
```cpp
public:
ConnectionInputPoint(
	XYZ^ pt
)
```
```fsharp
new :
        pt : XYZ -> ConnectionInputPoint
```

#### Parameters

pt XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ConnectionInputPoint Class

ConnectionInputPoint Overload

Autodesk.Revit.DB.Structure Namespace